Activity 4/app/Controllers/Customers.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $customerModel = new CustomerModel();

        $data['customers'] = $customerModel->findAll();

SELECT *
FROM `customers`
WHERE `customers`.`id` = '1'
---
    public function edit($id)
    {
        $model = new \App\Models\CustomerModel();

        $customer = $model->find($id);