Activity 4/app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $userModel = new UserModel();

        $data['users'] = $userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function edit($id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($id);