Activity 3/app/Controllers/Users.php

    public function index()
    {
        $userModel = new UserModel();

        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function edit($id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function update($id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'